/********************************
 8行星星历数据表,及数据表的计算
 ********************************/
export declare const XL0: number[][];
/********************************
 冥王星星历数据表
 ********************************/
export declare const XL0Pluto: number[][];
/********************************
 月亮星历数据表
 ********************************/
/******
 1.黄经精度(角秒):0.5
 2.黄纬精度(角秒):0.5
 3.距离精度(千米):1
 4.J2000.0时间最大偏移(世纪数):30
 5.小数点增补位数:3

 误差检测
 1.测试点数N；2<N<10001，如500 :2300
 2.偏移量rnd；0<=rnd<=1，如0.3 :0.2
 最大      平均
 经  0.468217  0.080642 (角秒)
 纬  0.346452  0.071540 (角秒)
 距  0.724653  0.153055 (千米)
 实际最大误差值大约为平均误差的6倍。
 ******/
export declare const XL1: number[][][];
export declare const XL0_xzb: number[];
